; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image3 - mode
	image2 - mode
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	Star5 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation3)
	(supports instrument2 spectrograph0)
	(supports instrument2 image3)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument3 image2)
	(supports instrument3 spectrograph0)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 infrared1)
	(supports instrument4 image3)
	(supports instrument4 image2)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument5 infrared1)
	(supports instrument5 spectrograph0)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation3)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 image3)
	(supports instrument8 infrared1)
	(supports instrument8 image2)
	(calibration_target instrument8 Star4)
	(supports instrument9 infrared1)
	(supports instrument9 spectrograph0)
	(supports instrument9 image3)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite5)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star4)
)
(:goal (and
	(pointing satellite4 Phenomenon6)
	(have_image Phenomenon6 image2)
	(have_image Phenomenon7 infrared1)
	(have_image Phenomenon8 spectrograph0)
	(have_image Phenomenon9 image3)
	(have_image Planet10 image2)
	(have_image Planet11 image2)
	(have_image Phenomenon12 image3)
	(have_image Planet13 image2)
))

)

; plan
1. (turn_to satellite4 groundstation1 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 0 of 9
3. (calibrate satellite4 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 9
4. (turn_to satellite4 planet11 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet11)
   goals met: 0 of 9
5. (take_image satellite4 planet11 instrument6 image2)
   added: (have_image planet11 image2)
   goals met: 1 of 9
6. (turn_to satellite4 planet10 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 planet10)
   goals met: 1 of 9
7. (take_image satellite4 planet10 instrument6 image2)
   added: (have_image planet10 image2)
   goals met: 2 of 9
8. (turn_to satellite4 phenomenon7 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon7)
   goals met: 2 of 9
9. (take_image satellite4 phenomenon7 instrument6 infrared1)
   added: (have_image phenomenon7 infrared1)
   goals met: 3 of 9
10. (turn_to satellite4 phenomenon6 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon6)
   goals met: 4 of 9
11. (take_image satellite4 phenomenon6 instrument6 image2)
   added: (have_image phenomenon6 image2)
   goals met: 5 of 9
12. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 5 of 9
13. (calibrate satellite3 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 5 of 9
14. (turn_to satellite3 phenomenon12 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon12)
   goals met: 5 of 9
15. (take_image satellite3 phenomenon12 instrument3 image3)
   added: (have_image phenomenon12 image3)
   goals met: 6 of 9
16. (turn_to satellite3 phenomenon8 phenomenon12)
   deleted: (pointing satellite3 phenomenon12)
   added: (pointing satellite3 phenomenon8)
   goals met: 6 of 9
17. (take_image satellite3 phenomenon8 instrument3 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 7 of 9
18. (turn_to satellite3 phenomenon9 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 phenomenon9)
   goals met: 7 of 9
19. (take_image satellite3 phenomenon9 instrument3 image3)
   added: (have_image phenomenon9 image3)
   goals met: 8 of 9
20. (turn_to satellite3 planet13 phenomenon9)
   deleted: (pointing satellite3 phenomenon9)
   added: (pointing satellite3 planet13)
   goals met: 8 of 9
21. (take_image satellite3 planet13 instrument3 image2)
   added: (have_image planet13 image2)
   goals met: 9 of 9
